Revit 2024 API
PointCollection Members
The PointCollection type exposes the following members.
Methods
Name | Description
Dispose
Releases all resources used by the PointCollection
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetBasicIEnumerator
Returns an enumerator that iterates through a collection.
GetEnumerator
Returns an enumerator that iterates through a collection.
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPointBufferPointer
 Returns an unsafe pointer to the buffer in which this collection stores the points.
GetPointIterator
 Creates and returns an iterator for the points contained in this collection.
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Count
 The number of points in this collection.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
PointCollection Class
Autodesk.Revit.DB.PointClouds Namespace